function fetchRequets() {
    const text = ' .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم] .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم] .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم]\
     .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم] .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم] .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم.[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم] .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم] .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم]\
     .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم] .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم] .[عشقی اگر] .[می کنی فرد] .تو آدم میره .خوب تو خوب تو دارم .آرزو که [دیگه رو] .خوب [تو] .[قبل] تو میشه [می گفتم] .با [خود] .خوب تو [رو خوب تو] .آرزو [مینه بمونه] که [ام] .خوب [دوم]'


    const request = {
        'id': 1,
        'icon': 1, 'filename': 'https://www.figma.com/design/zMgepw1CI8fRGx7aX1BS8S/Ava?node-id=1-3300&t=njh2TPrbLCY9fLsh-0',
        'upload_date': '1400-08-21', 'file_type': '.mp3', 'duration': '1:28:18', 'text': text, 'src_audio': 'https://ts17.tarafdari.com/contents/user874839/content-sound/fatemeh_mehlaban_-_atash_karevan_320.mp3',
        'segments': [{ "start": "00:03", "end": '00:13', 'text': 'فاطمه' }, { "start": "00:03", "end": '00:13', 'text': 'فاطمه' }, { "start": "00:03", "end": '00:13', 'text': 'فاطمه' }
            , { "start": "00:03", "end": '00:13', 'text': 'فاطمه' }, { "start": "00:03", "end": '00:13', 'text': 'فاطمه' },
            , { "start": "00:03", "end": '00:13', 'text': 'فاطمه' }, { "start": "00:03", "end": '00:13', 'text': 'فاطمه' },
            , { "start": "00:03", "end": '00:13', 'text': 'فاطمه' }, { "start": "00:03", "end": '00:13', 'text': 'فاطمه' },
            , { "start": "00:03", "end": '00:13', 'text': 'فاطمه' }, { "start": "00:03", "end": '00:13', 'text': 'فاطمه' },
            , { "start": "00:03", "end": '00:13', 'text': 'فاطمه' }, { "start": "00:03", "end": '00:13', 'text': 'فاطمه' }
        ]
    }

    const requests = []
    for (let i = 1; i < 66; i++) {
        request['duration'] = i + ":28:18"
        request['icon'] = (i % 3) + 1
        request['id'] = i
        requests.push({ ...request })
    }

    return requests

}

export function handleRequest({method, page, id}) {
    if (method === 'get') {
        let requests = fetchRequets()
        const size = requests.length
        if ((page * 5) <= size) {
            return requests.slice((page - 1) * 5, page * 5)
        }
        else{
            return requests.slice((page - 1) * 5, size)
        }
    }
    else if(method === 'del'){
            delArchive(id)
    }
}

function delArchive(id){
    
    
}
